elbertlin33-art/Edge-Voice-Authentication-System_CC3200/main_final.c
//*****************************************************************************
//
// Application Name     -   Edge Voice Authentication System
// Application Overview -   Final simple main for the PIR + OLED app flow.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup voice_auth
//! @{
//
//*****************************************************************************

#include <string.h>

// Driverlib includes
#include "hw_types.h"
#include "hw_ints.h"
#include "hw_memmap.h"
#include "rom.h"
#include "rom_map.h"
#include "interrupt.h"
#include "prcm.h"
#include "utils.h"
#include "spi.h"

// Common interface includes
#include "common.h"
#include "uart_if.h"

// App includes
#include "pin_mux_config.h"
#include "mic_capture.h"
#include "dsp_features.h"
#include "cloud_client.h"
#include "pir_sensor.h"
#include "ui.h"

#define APPLICATION_NAME        "Voice Auth"
#define APPLICATION_VERSION     "Final"
#define SPI_IF_BIT_RATE         1000000
#define RECORD_SECONDS          3
#define RECORD_SAMPLES          (MIC_SAMPLE_RATE_HZ * RECORD_SECONDS)
#define RECORD_CHUNK_SAMPLES    MIC_SAMPLE_RATE_HZ
#define RUN_BOOT_UPLOAD_TEST    0
#define AUDIO_NOISY_AVG_ABS     14000
#define AUDIO_NOISY_PEAK        62000
#define AUDIO_CLIPPED_AVG_ABS   4000
#define AUDIO_QUIET_AVG_ABS     200
#define AUDIO_QUIET_PEAK        1000

//*****************************************************************************
//                 GLOBAL VARIABLES -- Start
//*****************************************************************************

#if defined(ccs) || defined(gcc)
extern void (* const g_pfnVectors[])(void);
#endif

#if defined(ewarm)
extern uVectorEntry __vector_table;
#endif

static short gPcmBuffer[RECORD_SAMPLES];
static int gHasEnrolledUser = 0;

//*****************************************************************************
//                 GLOBAL VARIABLES -- End
//*****************************************************************************

//*****************************************************************************
//                      LOCAL FUNCTION PROTOTYPES
//*****************************************************************************

static void BoardInit(void);
static void OLED_SPIInit(void);
static void DelayMs(unsigned long ms);
static void App_ShowState(UIState_t state, int userId, int score);
static int Audio_CheckSignal(const short *pcm, unsigned long samples);
static int RecordThreeSecondClip(void);
static int CaptureVoiceClip(void);
static void App_ShowIdlePrompt(void);
static void App_ShowNoUserPrompt(void);
static int App_CheckCloudUsers(void);
static int IsReason(const CloudResult_t *result, const char *reason);
static int IsPasswordRetryReason(const CloudResult_t *result);
static int IsNameRetryReason(const CloudResult_t *result);
static void App_ShowCloudAudioRetry(const CloudResult_t *result);
static void HandleNoUserEnrollmentPrompt(void);
static void HandleEnrollFlow(void);
static void HandleMotionEvent(void);

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
#if defined(ccs)
    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif
#if defined(ewarm)
    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif
#endif

    MAP_IntMasterEnable();
    MAP_IntEnable(FAULT_SYSTICK);

    PRCMCC3200MCUInit();
}

//*****************************************************************************
//
//! OLED SPI Initialization
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void OLED_SPIInit(void)
{
    MAP_SPIReset(GSPI_BASE);
    MAP_SPIConfigSetExpClk(GSPI_BASE,
                           MAP_PRCMPeripheralClockGet(PRCM_GSPI),
                           SPI_IF_BIT_RATE,
                           SPI_MODE_MASTER,
                           SPI_SUB_MODE_0,
                           (SPI_SW_CTRL_CS |
                            SPI_4PIN_MODE |
                            SPI_TURBO_OFF |
                            SPI_CS_ACTIVELOW |
                            SPI_WL_8));
    MAP_SPIEnable(GSPI_BASE);
}

//*****************************************************************************
//
//! Simple delay in milliseconds
//!
//! \param  ms delay time
//!
//! \return None
//
//*****************************************************************************
static void DelayMs(unsigned long ms)
{
    while(ms--) {
        MAP_UtilsDelay(80000);
    }
}

static const char *StateName(UIState_t state)
{
    switch(state) {
        case UI_STATE_IDLE:
            return "IDLE";
        case UI_STATE_GET_READY:
            return "GET_READY";
        case UI_STATE_RECORDING:
            return "RECORDING";
        case UI_STATE_PROCESSING:
            return "PROCESSING";
        case UI_STATE_UPLOADING:
            return "UPLOADING";
        case UI_STATE_ENROLLING:
            return "ENROLLING";
        case UI_STATE_PASS:
            return "PASS";
        case UI_STATE_FAIL:
            return "FAIL";
        case UI_STATE_ENROLLED:
            return "ENROLLED";
        case UI_STATE_CLEARED:
            return "CLEARED";
        case UI_STATE_TOO_NOISY:
            return "TOO_NOISY";
        case UI_STATE_TOO_QUIET:
            return "TOO_QUIET";
        case UI_STATE_AWS_ERROR:
            return "AWS_ERROR";
        default:
            return "UNKNOWN";
    }
}

static void App_ShowState(UIState_t state, int userId, int score)
{
    UART_PRINT("STATE: %s", StateName(state));

    if(userId > 0) {
        UART_PRINT(" user=%d", userId);
    }

    if(score > 0) {
        UART_PRINT(" score=%d", score);
    }

    UART_PRINT("\n\r");
    UI_ShowState(state, userId, score);
}

static void App_ShowIdlePrompt(void)
{
    App_ShowState(UI_STATE_IDLE, 0, 0);
}

static void App_ShowNoUserPrompt(void)
{
    UART_PRINT("STATE: NO_USER\n\r");
    UART_PRINT("No existing profile, please enroll by saying apple\n\r");
    UI_ShowNoUser();
}

static int App_CheckCloudUsers(void)
{
    int hasUsers;

    hasUsers = Cloud_CheckUsers();
    if(hasUsers < 0) {
        App_ShowState(UI_STATE_AWS_ERROR, 0, 0);
        return -1;
    }

    gHasEnrolledUser = hasUsers;
    if(gHasEnrolledUser) {
        UART_PRINT("Cloud profiles: enrolled user found\n\r");
    } else {
        UART_PRINT("Cloud profiles: no enrolled user\n\r");
    }

    return 0;
}

static int Audio_CheckSignal(const short *pcm, unsigned long samples)
{
    tAudioStats stats;

    DSP_GetAudioStats(pcm, samples, &stats);

    UART_PRINT("Mic: min=%d max=%d peak_to_peak=%d avg_abs=%ld\n\r",
               stats.min,
               stats.max,
               stats.peakToPeak,
               stats.avgAbs);

    if((stats.avgAbs < AUDIO_QUIET_AVG_ABS) ||
       (stats.peakToPeak < AUDIO_QUIET_PEAK)) {
        UART_PRINT("Audio: too quiet\n\r");
        return UI_STATE_TOO_QUIET;
    }

    if((stats.avgAbs > AUDIO_NOISY_AVG_ABS) ||
       ((stats.peakToPeak > AUDIO_NOISY_PEAK) &&
        (stats.avgAbs > AUDIO_CLIPPED_AVG_ABS))) {
        UART_PRINT("Audio: too noisy\n\r");
        return UI_STATE_TOO_NOISY;
    }

    return 0;
}

//*****************************************************************************
//
//! Record one 3-second voice clip
//!
//! \param  None
//!
//! \return Number of samples recorded
//
//*****************************************************************************
static int RecordThreeSecondClip(void)
{
    unsigned long totalCaptured = 0;
    unsigned long chunkIndex;
    tMicCaptureStats stats;

    App_ShowState(UI_STATE_RECORDING, 0, 0);
    UART_PRINT("Mic: recording %d seconds...\n\r", RECORD_SECONDS);
    UART_PRINT("START TALKING NOW\n\r");

    for(chunkIndex = 0; chunkIndex < RECORD_SECONDS; chunkIndex++) {
        int captured;

        UART_PRINT("Mic: record chunk %lu / %d...\n\r",
                   chunkIndex + 1,
                   RECORD_SECONDS);

        if(chunkIndex == 0) {
            captured = Mic_RecordSamples(&gPcmBuffer[totalCaptured],
                                         RECORD_SAMPLES - totalCaptured,
                                         RECORD_CHUNK_SAMPLES);
        } else {
            captured = Mic_RecordMoreSamples(&gPcmBuffer[totalCaptured],
                                             RECORD_SAMPLES - totalCaptured,
                                             RECORD_CHUNK_SAMPLES);
        }

        UART_PRINT("Mic: chunk captured=%d\n\r", captured);
        if(captured <= 0) {
            UART_PRINT("Mic: chunk failed, captured=%d\n\r", captured);
            break;
        }

        totalCaptured += (unsigned long)captured;

        UART_PRINT("Mic: captured %lu / %lu samples\n\r",
                   totalCaptured,
                   (unsigned long)RECORD_SAMPLES);

        if(captured != RECORD_CHUNK_SAMPLES) {
            UART_PRINT("Mic: short chunk, wanted=%lu got=%d\n\r",
                       (unsigned long)RECORD_CHUNK_SAMPLES,
                       captured);
            break;
        }
    }

    Mic_GetDmaStats(&stats);
    UART_PRINT("Mic: dma rx=%lu tx=%lu dropped=%lu\n\r",
               stats.rxDmaCount,
               stats.txDmaCount,
               stats.droppedSamples);
    UART_PRINT("Mic: audio bytes ready = %lu\n\r", totalCaptured * sizeof(short));
    UART_PRINT("STOP TALKING\n\r");

    return (int)totalCaptured;
}

static int CaptureVoiceClip(void)
{
    int samplesRecorded;
    int audioProblem;

    samplesRecorded = RecordThreeSecondClip();
    if(samplesRecorded != RECORD_SAMPLES) {
        App_ShowState(UI_STATE_FAIL, 0, 0);
        DelayMs(2000);
        return -1;
    }

    audioProblem = Audio_CheckSignal(gPcmBuffer, RECORD_SAMPLES);
    if(audioProblem != 0) {
        App_ShowState((UIState_t)audioProblem, 0, 0);
        DelayMs(2000);
        return -1;
    }

    return 0;
}

static int IsReason(const CloudResult_t *result, const char *reason)
{
    if((result == 0) || (reason == 0)) {
        return 0;
    }

    return (strcmp(result->reason, reason) == 0);
}

static int IsPasswordRetryReason(const CloudResult_t *result)
{
    return (IsReason(result, "too_quiet") ||
            IsReason(result, "too_noisy") ||
            IsReason(result, "no_word") ||
            IsReason(result, "no_password") ||
            IsReason(result, "bad_profile_audio") ||
            IsReason(result, "password_cannot_be_apple"));
}

static int IsNameRetryReason(const CloudResult_t *result)
{
    return (IsReason(result, "too_quiet") ||
            IsReason(result, "too_noisy") ||
            IsReason(result, "no_word") ||
            IsReason(result, "no_user_name"));
}

static void App_ShowCloudAudioRetry(const CloudResult_t *result)
{
    if(IsReason(result, "too_noisy")) {
        App_ShowState(UI_STATE_TOO_NOISY, 0, 0);
    } else if(IsReason(result, "too_quiet")) {
        App_ShowState(UI_STATE_TOO_QUIET, 0, 0);
    } else {
        App_ShowState(UI_STATE_FAIL, 0, result->score);
    }

    DelayMs(2000);
}

static void HandleEnrollFlow(void)
{
    CloudResult_t passwordResult;
    CloudResult_t nameResult;

    while(1) {
        App_ShowState(UI_STATE_ENROLLING, 0, 0);
        UART_PRINT("ENROLL: get ready to say password\n\r");
        DelayMs(1000);

        App_ShowState(UI_STATE_GET_READY, 0, 0);
        DelayMs(1000);

        if(CaptureVoiceClip() < 0) {
            UART_PRINT("ENROLL: passphrase not clear, retrying password prompt\n\r");
            continue;
        }

        App_ShowState(UI_STATE_UPLOADING, 0, 0);
        if(Cloud_EnrollPassword(gPcmBuffer, RECORD_SAMPLES, &passwordResult) < 0) {
            App_ShowState(UI_STATE_AWS_ERROR, 0, 0);
            DelayMs(2000);
            return;
        }

        if(IsPasswordRetryReason(&passwordResult)) {
            UART_PRINT("ENROLL: password rejected: %s\n\r", passwordResult.reason);
            App_ShowCloudAudioRetry(&passwordResult);
            continue;
        }

        if(passwordResult.command != CLOUD_COMMAND_ENROLL) {
            App_ShowState(UI_STATE_FAIL, 0, passwordResult.score);
            DelayMs(2000);
            return;
        }

        break;
    }

    UART_PRINT("Password words: %s\n\r", passwordResult.words);
    UI_ShowWords(passwordResult.words);
    DelayMs(2000);

    while(1) {
        UART_PRINT("ENROLL: get ready to say user name\n\r");
        App_ShowState(UI_STATE_GET_READY, 0, 0);
        DelayMs(1000);

        if(CaptureVoiceClip() < 0) {
            UART_PRINT("ENROLL: user name not clear, retrying name prompt\n\r");
            continue;
        }

        App_ShowState(UI_STATE_UPLOADING, 0, 0);
        if(Cloud_EnrollName(gPcmBuffer, RECORD_SAMPLES, &nameResult) < 0) {
            App_ShowState(UI_STATE_AWS_ERROR, 0, 0);
            DelayMs(2000);
            return;
        }

        if(IsNameRetryReason(&nameResult)) {
            UART_PRINT("ENROLL: name rejected: %s\n\r", nameResult.reason);
            App_ShowCloudAudioRetry(&nameResult);
            continue;
        }

        if(nameResult.command != CLOUD_COMMAND_ENROLL) {
            App_ShowState(UI_STATE_FAIL, 0, nameResult.score);
            DelayMs(2000);
            return;
        }

        break;
    }

    UART_PRINT("User name: %s\n\r", nameResult.userName);
    UART_PRINT("Saved password: %s\n\r", nameResult.password);
    gHasEnrolledUser = 1;
    App_ShowState(UI_STATE_ENROLLED, nameResult.userId, 0);
    DelayMs(1500);
    UI_ShowWelcome(nameResult.userName);
    DelayMs(2000);
}

static void HandleNoUserEnrollmentPrompt(void)
{
    CloudResult_t cloudResult;

    App_ShowNoUserPrompt();
    DelayMs(1000);

    if(CaptureVoiceClip() < 0) {
        return;
    }

    App_ShowState(UI_STATE_UPLOADING, 0, 0);
    if(Cloud_ProcessVoice(gPcmBuffer, RECORD_SAMPLES, &cloudResult) < 0) {
        App_ShowState(UI_STATE_AWS_ERROR, 0, 0);
        DelayMs(2000);
        return;
    }

    if(cloudResult.command == CLOUD_COMMAND_ENROLL) {
        HandleEnrollFlow();
        return;
    }

    UART_PRINT("NO_USER: heard '%s', returning idle\n\r", cloudResult.words);
}

//*****************************************************************************
//
//! Run one voice-auth attempt after PIR motion
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void HandleMotionEvent(void)
{
    CloudResult_t cloudResult;

    App_ShowState(UI_STATE_GET_READY, 0, 0);
    DelayMs(1000);

    if(CaptureVoiceClip() < 0) {
        return;
    }

    App_ShowState(UI_STATE_UPLOADING, 0, 0);

    if(Cloud_ProcessVoice(gPcmBuffer, RECORD_SAMPLES, &cloudResult) < 0) {
        App_ShowState(UI_STATE_AWS_ERROR, 0, 0);
        DelayMs(2000);
        return;
    }

    if(strcmp(cloudResult.reason, "no_enrolled_user") == 0) {
        gHasEnrolledUser = 0;
        HandleNoUserEnrollmentPrompt();
        return;
    }

    if((cloudResult.words[0] == '\0') ||
       (strcmp(cloudResult.reason, "no_word") == 0)) {
        UART_PRINT("No words detected, returning idle\n\r");
        return;
    }

    UART_PRINT("Word detected: %s\n\r", cloudResult.word);
    UART_PRINT("Words from cloud: %s\n\r", cloudResult.words);

    if(cloudResult.command == CLOUD_COMMAND_ENROLL) {
        HandleEnrollFlow();
    } else if(cloudResult.command == CLOUD_COMMAND_CLEAR) {
        gHasEnrolledUser = 0;
        App_ShowState(UI_STATE_CLEARED, 0, 0);
        DelayMs(2000);
        HandleNoUserEnrollmentPrompt();
    } else if(cloudResult.command == CLOUD_COMMAND_AUTHENTICATE) {
        if(cloudResult.passed) {
            App_ShowState(UI_STATE_PASS, cloudResult.userId, cloudResult.score);
            DelayMs(1500);
            UI_ShowWelcome(cloudResult.userName);
        } else {
            UART_PRINT("Result: Fail (%d%%)\n\r", cloudResult.score);
            App_ShowState(UI_STATE_FAIL, cloudResult.userId, cloudResult.score);
        }
        DelayMs(2000);
    } else {
        App_ShowState(UI_STATE_AWS_ERROR, 0, 0);
        DelayMs(2000);
    }
}

//*****************************************************************************
//
//! Main
//!
//! \param  none
//!
//! \return None
//
//*****************************************************************************
void main()
{
    long lRetVal = -1;

    BoardInit();
    PinMuxConfig();
    InitTerm();
    ClearTerm();

    OLED_SPIInit();
    UI_Init();
    UART_PRINT("STATE: INITIALIZING\n\r");
    UI_ShowInitializing();
    DelayMs(500);

    UART_PRINT("STATE: CONNECTING_WIFI\n\r");
    UI_ShowConnectingWifi();
    lRetVal = Cloud_Init();
    if(lRetVal < 0) {
        App_ShowState(UI_STATE_FAIL, 0, 0);
        UART_PRINT("Unable to initialize cloud client\n\r");
        LOOP_FOREVER();
    }

    UART_PRINT("STATE: WAIT\n\r");
    UI_ShowWait();
    if(App_CheckCloudUsers() < 0) {
        UART_PRINT("Unable to check cloud profiles\n\r");
        LOOP_FOREVER();
    }

    if(!gHasEnrolledUser) {
        App_ShowNoUserPrompt();
    }

    PIR_Init();

    lRetVal = Mic_Init();
    if(lRetVal < 0) {
        App_ShowState(UI_STATE_FAIL, 0, 0);
        UART_PRINT("Unable to initialize microphone\n\r");
        LOOP_FOREVER();
    }

    App_ShowIdlePrompt();

#if RUN_BOOT_UPLOAD_TEST
    UART_PRINT("TEST: running one recording/upload without PIR\n\r");
    HandleMotionEvent();
    App_ShowIdlePrompt();
#endif

    while(1) {
        if(PIR_MotionDetected()) {
            UART_PRINT("PIR: motion detected\n\r");

            if(!gHasEnrolledUser) {
                if(App_CheckCloudUsers() < 0) {
                    UART_PRINT("Unable to check cloud profiles\n\r");
                } else if(!gHasEnrolledUser) {
                    HandleNoUserEnrollmentPrompt();
                } else {
                    HandleMotionEvent();
                }
            } else {
                HandleMotionEvent();
            }

            App_ShowIdlePrompt();
            UART_PRINT("PIR: signal after idle = %d\n\r", PIR_MotionDetected());
        } else {
            DelayMs(100);
        }
    }
}
